NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_lmac.svd
          <register>
            <name>TSIZ</name>
            <description>Description cluster: Host Channel Transfer Size Register 0</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>XFERSIZE</name>
                <description>Non-Scatter/Gather DMA Mode:</description>
                <lsb>0</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>PKTCNT</name>
                <description>Non-Scatter/Gather DMA Mode:</description>
                <lsb>19</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>PID</name>
                <description>PID (Pid)</description>
                <lsb>29</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DATA0</name>
                    <description>DATA0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATA2</name>
                    <description>DATA2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DATA1</name>
                    <description>DATA1</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MDATA</name>
                    <description>MDATA (non-control)/SETUP (control)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DOPNG</name>
                <description>Do Ping (DoPng)</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOPING</name>
                    <description>No ping protocol</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PING</name>
                    <description>Ping protocol</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DMA</name>
            <description>Description cluster: Host Channel DMA Address Register 0</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DMAADDR</name>
                <description>In Buffer DMA Mode:</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMAB</name>
            <description>Description cluster: Host Channel DMA Buffer Address Register 0</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HCDMAB</name>
                <description>Holds the current buffer address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DCFG</name>
          <description>Device Configuration Register</description>
          <addressOffset>0x800</addressOffset>
          <access>read-write</access>
          <resetValue>0x08020000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DEVSPD</name>
              <description>Device Speed (DevSpd)</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USBHS20</name>
                  <description>High speed USB 2.0 PHY clock is 30 MHz or 60 MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBFS20</name>
                  <description>Full speed USB 2.0 PHY clock is 30 MHz or 60 MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBLS116</name>
                  <description>Low speed USB 1.1 transceiver clock is 6 MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBFS1148</name>
                  <description>Full speed USB 1.1 transceiver clock is 48 MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NZSTSOUTHSHK</name>
              <description>Non-Zero-Length Status OUT Handshake (NZStsOUTHShk)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENDOUT</name>
                  <description>Send the received OUT packet to the application (zero-length or non-zero length) and send a handshake based on NAK and STALL bits for the endpoint in the Devce Endpoint Control Register</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENDSTALL</name>
                  <description>Send a STALL handshake on a nonzero-length status OUT transaction and do not send the received OUT packet to the application</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA32KHZSUSP</name>
              <description>Enable 32 KHz Suspend mode (Ena32KHzSusp)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>USB 1.1 Full-Speed Serial Transceiver not selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>USB 1.1 Full-Speed Serial Transceiver Interface selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEVADDR</name>
              <description>Device Address (DevAddr)</description>
              <lsb>4</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>PERFRINT</name>
              <description>Periodic Frame Interval (PerFrInt)</description>
              <lsb>11</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EOPF80</name>
                  <description>80 percent of the (micro)Frame interval</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOPF85</name>
                  <description>85 percent of the (micro)Frame interval</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOPF90</name>
                  <description>90 percent of the (micro)Frame interval</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOPF95</name>
                  <description>95 percent of the (micro)Frame interval</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDEVOUTNAK</name>
              <description>Enable Device OUT NAK (EnDevOutNak)</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The core does not set NAK after Bulk OUT transfer complete</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The core sets NAK after Bulk OUT transfer complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XCVRDLY</name>
              <description>XCVRDLY</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No delay between xcvr_sel and txvalid during Device chirp</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable delay between xcvr_sel and txvalid during Device chirp</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRATICINTMSK</name>
              <description>Erratic Error Interrupt Mask</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>Early suspend interrupt is generated on erratic error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask early suspend interrupt on erratic error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPGISOCSUPT</name>
              <description>Worst-Case Inter-Packet Gap ISOC OUT Support (ipgisocSupt)</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Worst-Case Inter-Packet Gap ISOC OUT Support is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Worst-Case Inter-Packet Gap ISOC OUT Support is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DESCDMA</name>
              <description>Enable Scatter/gather DMA in device mode (DescDMA).</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable Scatter/Gather DMA</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable Scatter/Gather DMA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERSCHINTVL</name>
              <description>Periodic Scheduling Interval (PerSchIntvl)</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MF25</name>
                  <description>25 percent of (micro)Frame</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MF50</name>
                  <description>50 percent of (micro)Frame</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MF75</name>
                  <description>75 percent of (micro)Frame</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESVALID</name>
              <description>Resume Validation Period (ResValid)</description>
              <lsb>26</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
